{
  "header": {
    "AboutMeLink": "A propos",
    "projectsLink": "Mes œuvres",
    "resumeLink": "Obtenir mon CV"
  },
  "followMe": "SUIVEZ-MOI SUR",
  "contactMe": "CONTACTEZ-MOI",
  "logoDesc": "Randy Assani RM Logo",
  "githubIconDesc": "Randy Assani profil Github",
  "LinkdinIconDesc": "Randy Assani profil Linkdin",
  "seeMore": "VOIR PLUS",
  "homePage": {
    "heroSection": {
      "iAm": "Je suis",
      "myPassionsP1": "La technologie, le développement de logiciels",
      "myPassionsP2": "et la conception sont mes passions.",
      "contactBtn": "ÉCRIVEZ-MOI",
      "myResume": "MON CV"
    },
    "aboutMeSection": {
      "aboutMeTitleP1": "À PROPOS DE",
      "aboutMeTitleP2": "MOI",
      "aboutMeDescriptionP1": "SALUT ! Je suis Randy Assani Beni (RM).",
      "aboutMeDescriptionP2": "Je suis",
      "aboutMeDescriptionP3": "Software Engineer",
      "aboutMeDescriptionP4": "avec un diplôme en informatique et une expérience en ingénierie informatique, développement de logiciels, conception UX/UI, gestion de projet et enseignement.",
      "aboutMeDescriptionP5": "Je suis toujours en train de développer mes compétences et d'apprendre quelque chose de nouveau. J'ai une soif de connaissances et un désir de comprendre comment les choses fonctionnent ; je suis un homme de contact, un bricoleur, un amoureux de la technologie et des sciences."
    },
    "teachingExperience": "Enseigner la programmation et le génie logiciel a été une expérience très enrichissante. J'ai pu partager ma passion pour ces matières avec des étudiants de niveaux et d'horizons différents.",
    "technologiesSection": {
      "technologiesTitleP1": "TECH",
      "technologiesTitleP2": "NOLOGIES",
      "technologiesDesc": "Voici quelques technologies avec lesquelles j'ai travaillé récemment"
    },
    "experienceSection": {
      "experienceTitleP1": "EXP",
      "experienceTitleP2": "ERIENCE",
      "engineeringCard": {
        "engineeringCardTitle": "INGENIERIE",
        "engineeringCardIconDesc": "Icône d'outils",
        "engineeringCardDesc": "Capable de concevoir et de développer des applications web et mobiles de haute qualité en utilisant des langages de programmation tels que Java, JavaScript et Php... Ma solide compréhension des principes de l'ingénierie logicielle me permet de résoudre efficacement des problèmes complexes et de fournir des solutions innovantes à mes clients."
      },
      "designCard": {
        "designCardTitle": "UX/UI DESIGN",
        "designCardIconDesc": "Icône de crayon de design",
        "designCardDesc": "Capable de créer des interfaces utilisateur intuitives et attrayantes à l'aide d'outils tels que Figma... Ma compréhension approfondie de l'expérience utilisateur me permet de concevoir des parcours cohérents et fluides qui répondent aux besoins des utilisateurs tout en respectant les objectifs commerciaux de mes clients."
      },
      "projectCard": {
        "projectCardTitle": "PROJET",
        "projectCardIconDesc": "Icône d'étoile du classement",
        "projectCardDesc": "Capable de diriger des équipes interfonctionnelles dans la réalisation de projets complexes en utilisant des méthodologies agiles telles que Scrum et Kanban. Ma capacité à gérer les priorités, à favoriser la collaboration et à résoudre les problèmes rapidement me permet de fournir des produits de haute qualité dans les délais impartis."
      }
    },
    "sendMessageSection": {
      "sendMessageTitle": "Envoyez un message !",
      "sendMessageDescP1": "Vous avez une question ou une proposition, ou vous souhaitez simplement",
      "sendMessageDescP2": "dire bonjour ? Allez-y.",
      "inputName": {
        "label": "VOTRE NOM",
        "placeholder": "Entrez votre nom",
        "errorMin": "Il faut au moins 2 caractère(s)",
        "errorMax": "Il faut au maximum 100 caractères."
      },
      "inputEmail": {
        "label": "VOTRE EMAIL",
        "placeholder": "Entrez votre adresse e-mail",
        "emailError": "Email invalide"
      },
      "inputMessage": {
        "label": "VOTRE MESSAGE",
        "placeholder": "Entrez votre message",
        "errorMin": "Le message doit contenir au moins 10 caractère(s)",
        "errorMax": "Le message doit contenir au maximum 3000 caractères."
      },
      "sendMessageBtn": "ENVOYEZ VOTRE MESSAGE",
      "emailMessageInProgress": "Envoi de mail en cours.",
      "emailMessageInSucces": "Votre message a été envoyé avec succès.",
      "emailMessageInErreur": "Une erreur s'est produite lors de l'envoi de votre message. Veuillez réessayer plus tard.",
      "emailMessageInWarning": "Vous avez déjà dépassé la limite de 3 e-mails pour cette session"
    }
  },
  "projectPage": {
    "heroSection": {
      "visitMyWorks": "Mes œuvres",
      "leadText": "Voici quelques projets que j'ai réalisés récemment"
    }
  },
  "errorPage": {
    "errorIcon": "Icône de page non trouvée",
    "errorPageMessage": "La page n'est pas trouvée",
    "goBackHome": "Cliquez ici pour retourner à la page d'accueil"
  },
  "projects": {
    "kadeaOnlineDesc": "Kadea Online est une plateforme interactive d'apprentissage en ligne pour les métiers du numérique. C'est l'un de mes projets préférés. J'ai développé et maintenu ce projet pour la société Kadea.",
    "kameoliveDesc": "Cameolive est une application qui permet de rechercher des informations sur les séries et les films à l'aide d'un appareil connecté à Internet. Il s'agit d'un projet personnel.",
    "robotFrindDesc": "Application ludique qui affiche une liste de personnages drôles et amusants. Cette application permet de consulter la liste des personnages et de voir les détails les concernant. Ce projet est un projet d'exercice."
  }
}
